In [1]:
%load_ext autoreload
%autoreload 2
import sys
# map folder using sys
sys.path.append('../')
from galgoz import Galgoz

In [2]:
gz = Galgoz()

date_from = "2005-01-01T00:00:00Z"
date_to = "2024-12-28T00:00:00Z"
gz.store_data(granularity="D", date_from=date_from, date_to=date_to, price="M")

Fetching candles from 2005-01-01 00:00:00 to 2018-09-10 00:00:00
Total candles fetched: 4237
Fetching candles from 2018-09-10 00:00:00 to 2024-12-28 00:00:00
Total candles fetched: 1641
Data saved to /Users/gaz/galgoz/data/GBP_JPY_D.pkl

In [3]:
import pandas as pd
from galgoz.galgoz import DATA_FOLDER
filename = DATA_FOLDER / "GBP_JPY_H1.pkl"
df = pd.read_pickle(filename)
df.head()

,complete,volume,time,mid_o,mid_h,mid_l,mid_c
0,True,4,2005-01-02T18:00:00.000000000Z,196.780,196.820,196.750,196.790
1,True,54,2005-01-02T19:00:00.000000000Z,196.910,197.210,196.880,197.130
2,True,127,2005-01-02T20:00:00.000000000Z,197.120,197.250,197.030,197.180
3,True,199,2005-01-02T21:00:00.000000000Z,197.180,197.300,197.080,197.150
4,True,144,2005-01-02T22:00:00.000000000Z,197.140,197.150,196.920,196.950